Revit 2024 API
PointNode Class
 An output node that represents a 3D point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class PointNode : ModelCurveNode
Visual Basic
Public Class PointNode _
	Inherits ModelCurveNode
Visual C++
public ref class PointNode : public ModelCurveNode
Remarks
 See also: [!:Autodesk::Revit::DB::IModelExportContext::OnPoint].
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ModelCurveNode
 Autodesk.Revit.DB.PointNode
See Also
PointNode Members
Autodesk.Revit.DB Namespace